Repository: seanpm2001/mt-training-data
Catalog: ts/ts_pontoon.tmx
Source language: en_us
Languages: ts

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
ts: Ku vonaka onge a ku na swilo leswi u nga swi yingisela eka ririmi leri. Hi pfune leswaku hi siva mpfhuka hi ku rekhoda yin’wana sweswi.

source: Luganda
ts: Xiluganda

source: Luxembourgish
ts: Xiluxembourg

source: Macedonian
ts: Ximakedoniya

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
ts: Tiyiseka leswaku pulatifomo yi rhekhoda u nga si sungula ku vulavula, ni leswaku yi yima ntsena loko u hetile.

source: Make sure the sentence meets the following criteria:
ts: Tiyisisa leswaku xivulwa xi fikelela swipimelo leswi landzelaka:

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
ts: Endla leswaku datha ya wena leyi rhumeriweke yi tiya loko swi kotekaka hi ku nyika datha yin’wana ya nhlayo ya vaaki leyi nga tiviwiki. Hi tumbeta data hinkwayo ya nhlayo ya vaaki hi nga si yi endla erivaleni.

source: Malagasy
ts: Ximalagaxi

source: Malay
ts: Ximalay

source: Malayalam
ts: Ximalayalam

source: Male
ts: Xinuna

source: Maltese
ts: Ximalta

source: Manage Email Subscriptions
ts: Lawula Swikhokhelo swa Imeyili

source: Manage Subscriptions
ts: Lawula Swikhokhelo

source: Marathi
ts: Ximarathi

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
ts: Kumbexana <homepageLink>pheji ya hina ya le mahlweni</homepageLink> ta pfuna? Ku vutisa xivutiso, hi kombela u joyina <matrixLink>Matrix community chat</matrixLink>, languta timhaka ta sayiti hi ku tirhisa <githubLink>GitHub</githubLink> kumbe u endzela <discourseLink>tiforamu ta hina ta Discourse</discourseLink>.

source: Message
ts: Hungu

source: [Mismatched content]
ts: [Nhundzu leyi nga fambelaniki]

source: Misreadings
ts: Ku hlayiwa loku hoxeke

source: Missing an <strong>'s'</strong> at the end of a word.
ts: Ku pfumala <strong>'s'</strong> emakumu ka rito.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
ts: Ku kayivela <strong>'A'</strong> kumbe <strong>'The'</strong> eku sunguleni ka ku rhekhodiwa.

source: Missing the end of the last word by cutting off the recording too quickly.
ts: Ku pfumala makumu ya rito ro hetelela hi ku tsema rhekhodo hi ku hatlisa swinene.

source: Mixed
ts: Swo Hlangana

source: Mongolian
ts: Ximongolia

source: More
ts: Swo tala

source: [More has been recorded than the required text]
ts: [Ku rhekhodiwile swo tala ku tlula tsalwa leri lavekaka]

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
ts: Vunyingi bya data leyi tirhisiwaka hi tikhamphani letikulu a yi kumeki eka vunyingi bya vanhu. Hi ehleketa kuri leswi swi sivela vutumbuluxi. Kutani hi simeke Common Voice, phurojeke yo pfuneta ku endla lemukiso wa rito lowu pfulekeke na ku fikeleriwa hi un’wana ni un’wana.

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
ts: "Vunyingi bya data leyi tirhisiwaka hi tikhamphani letikulu a yi kumeki eka vunyingi bya vanhu. Hi ehleketa leswi swivelaka ku endla swilo leswintshwa. Kutani hi humese Project Common Voice, phurojeke yo pfuneta ku endla rito ku xiximiwa loku nga pfuleka eka un’wana ni un’wana."

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
ts: Swifaniso swo tala leswi rhekhodiweke i swa vanhu lava vulavulaka hi rito ra vona ra ntumbuluko. U nga amukela rhekhodo ya nkarhi na nkarhi leyi nga riki yo toloveleka leyi huwelelaka, yi hleveteriwa, kumbe leyi nga erivaleni leswaku yi nyikeriwa hi rito ro ‘hlamarisa’. Hi kombela u ala swilo leswi rhekhodiweke ni leswi tirhisaka rito leri endliweke hi khompyuta.

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
ts: Tidathabeyisi to tala ta mbulavulo ti leteriwile hi ku yimela ku tlula mpimo ka nhlayo yo karhi ya vaaki leswi endlaka leswaku ku va na ku va na xihlawuhlawu eka <articleLink>xiyimo xa xinuna na xa le xikarhi</articleLink>. Ti-accent na tindzimi leti talaka ku va ti nga yimeriwi ngopfu eka tisethi ta datha ya ndzetelo hi ntolovelo ti fambelanisiwa na mintlawa ya vanhu lava se va nga le tlhelo. Michini yo tala na yona yi lwela ku twisisa marito ya vavasati. Leswi hi swona swi endlaka leswaku eka database ya hina ya rito hi lava ku hambana-hambana!

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
ts: Mozilla Common Voice i gingiriko ro pfuneta ku dyondzisa michini ndlela leyi vanhu va xiviri va vulavulaka hi yona.

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
ts: Mozilla Common Voice yi endliwe ku ri yi koteka hi vaaki vo hambana va valweri, vativi va tindzimi, vativi va sayense ya data, swidyondzeki na vanjhiniyara va software ku suka emisaveni hinkwayo. Phurojeke leyi yi fambisiwa hi Mozilla Foundation.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
ts: Mozilla yi tinyiketerile ku endla leswaku webu yi tshama yi pfulekile na ku ri yi fikelekeka ka vanhu hinkwavo hi ku olova. Ku endla ku ri leswi swi koteka hi fanele ku nyika vatumbuluxi va webu matimba hi ku tirhisa tiphurojeke to fana na Common Voice. Loko titheknoloji ta rito ti karhi ti andza ku tlula switirhisiwa leswi hlawulekeke, hi tshemba leswaku ti fanele ku tirhela vatirhisi hinkwavo hi ku ringana. Sweswo swi vula ku vekisa eka tindzimi to tala na ku amukela mavulavulelo o hambana na nhlayo ya vaaki loko ku akiwa no kambela thekinoloji ya rito. Common Voice i xitirhisiwa xa mani na mani lexi kumekaka eka un’wana na un’wana naswona mintlawa ya Mozilla na vatumbuluxi se va xi tirhisa eka tiphurojeke ta hina na tona emisaveni hinkwayo.

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
ts: Injhini yo tiva rito ya xihlovo lexi pfulekeke ya Mozilla leyi nge Deep Speech yi nga tirhisiwa ku aka switirhisiwa swo tiva mbulavulo. Hlaya <githubLink>nkatsakanyo wa hina wa Github</githubLink> kutani u joyina <discourseLink>DeepSpeech Discourse</discourseLink> ku dyondza ndlela yo sungula.

source: Mutual accountability.
ts: Ku tihlamulelana ka vumbirhi.

source: My Sentences
ts: Swivulwa swa Mina

source: Name
ts: Vito

source: Names of your language
ts: Mavito ya ririmi ra wena

source: Native Language
ts: Ririmi ra Rixaka

source: Need some help with accent?
ts: Xana u lava mpfuno wo karhi hi mavulavulelo?

source: Need some help with variants?
ts: U lava mpfuno wo karhi hi ku hambana-hambana?

source: Need to download your data?
ts: Xana u lava ku downloada rungula ra wena?

source: Nepali
ts: Xinepali

source: New Language Launch
ts: Ku Simekiwa Ka Ririmi Lerintshwa

source: Next
ts: Landzelaka

source: Next Goals: { $goal }
ts: Tipakani leti landzelaka: { $goal }

source: No
ts: E-e

source: [No ‘a’ in the original text]
ts: [Ku hava ‘a’ eka tsalwa ro sungula].

source: No gravatar found for your email
ts: Ku hava gravatar leyi kumiweke eka imeyili ya wena

source: No microphone found.
ts: Ku hava xikurisa-marito lexi kumiweke.

source: No rejected sentences found!
ts: Ku hava swivulwa leswi ariweke leswi kumiweke!

source: Northern Sotho
ts: Xisotho xa le N’walungwini

source: Norwegian Bokmål
ts: Bokmål ya le Norway

source: Norwegian Nynorsk
ts: Nynorsk ya le Norway

source: No sentences found!
ts: Ku hava swivulwa leswi kumiweke!

source: No sentences to review. <addLink>Add more sentences now!</addLink>
ts: Ku hava swivulwa swo pfuxeta. <addLink>Engetela swivulwa swin’wana sweswi!</addLink>

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
ts: Xiya: Loko yi vekiwile eka 'Visible', xiyimiso lexi xi nga cinciwa ku suka eka <profileLink>Tluka ra xivumbeko</profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
ts: Xiya: Wa ha ta lava ku hlawula exikarhi ka Vulavula kumbe Yingisela ku cinca muxaka wa munyikelo.

source: No Thanks
ts: Hayi Ndza Nkhensa

source: No variant selected
ts: Ku hava muxaka lowu hlawuriweke

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
ts: Sweswi u tivaka swo tala nyana hi Common Voice, ku sele yini ku ri u yi ringeti? Tsopeta eka xifaniso xa xikurisa-marito leswaku u sungula ku hlaya swivulwa hi rito leri tlakukeke. <br/><br/>Loko u tsakela ku kambisisa minyikelo ya rito ya vanhu van’wana, tsopeta eka xifaniso xa ku tlanga. U ta pfuneta ku amukela swi fambelana na swivulwa leswi nga tsariwa eka xikirini.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
ts: Sweswi u nga nyikela hi rito ra wena ku hi pfuna ku aka dathabeyisi ya rito leyi pfulekeke leyi un’wana na un’wana a nga yi tirhisaka ku endla ti-app ta vutshila ta switirhisiwa na webu. Hlaya xivulwa leswaku u pfuna michini ku dyondza ndlela leyi vanhu va xiviri va vulavulaka ha yona. Languta ntirho wa van’wana va hoxa xandla ku antswisa khwalithi. Swi va swi olovile hi ndlela yoleyo!

source: Number of Voices
ts: Nhlayo ya Marito

source: Numbers. There should be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
ts: Tinhlayo. A ku fanelanga ku va ni tinhlayo eka tsalwa ra xihlovo hikuva ti nga vanga swiphiqo loko ti hlayiwa ehenhla. Ndlela leyi nomboro yi hlayiwaka hi yona yi famba hi mongo naswona yi nga ha nghenisa ku pfilunganyeka eka dataset. Xikombiso, nomboro ya “2409” yi nga hlayiwa kahle tanihi havumbirhi bya “makhume-mbirhi-mune ziro nhungu” na “magidi mambirhi na madzana mune nhungu”.

source: Occitan
ts: Xioccitan

source: Odia
ts: Xiodia

source: Off
ts: Timile

source: Offensive language
ts: Ririmi leri khunguvanyisaka

source: Offensive speech
ts: Nkulumo leyi khunguvanyisaka

source: On
ts: Pfuriwile

source: Once logged in you can select your languages from the profile section.
ts: Loko se u nghena u nga hlawula tindzimi ta wena eka xiyenge xa ​phurofayili.

source: On desktop devices you can contribute by downloading…
ts: Eka switirhisiwa swa khompyuta u nga hoxa xandla hi ku dawuniloda...

source: One sentence per line
ts: Xivulwa xin’we hi ntila

source: On his head he wore a beret.
ts: Enhlokweni yakwe a ambale berete.

source: On iOS please continue with Safari to enable recording…
ts: Eka iOS hi kombela u ya emahlweni na Safari ku endla leswaku ku rhekhoda ku tirha...

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
ts: Hi hala tlhelo, loko u ehleketa leswaku kumbexana muhlayi a nga si tshama a hlangana na rito leri, naswona u endla ntsena ku ringanyeta loku hoxeke eka mavitanelo ya rona, hi kombela u ala. Loko u nga tiyiseki, tsopeta tlula.

source: Optionally join on our email list for updates and new information about the project.
ts: Hi ku hlawula joyina eka nxaxamelo wa hina wa ti-imeyili ku kuma swintshuxo na vuxokoxoko lebyintshwa mayelana na phurojeke.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
ts: Data ya nhlayo ya vaaki leyi rhumeriweke hi ku hlawula (xik. malembe, rimbewu, ririmi, na mavalavulelo) a yi nge pfuki yi endliwe erivaleni eka phurofayili ya wena, naswona a yi nge hlanganisiwi na akhawunti ya wena eka dataset. Swiphemu swa mpfumawulo swa munhu hi xiyexe swi ta fambelanisiwa na datha ya nhlayo ya vaaki hi xikongomelo xa nxopaxopo lowu kongomeke swinene - xikombiso, mulavisisi a nga ha lava ku kongomisa modele wa ndzetelo eka xiyenge xo karhi xa nhlayo ya vaaki.

source: Other
ts: Swin'wana

source: Other Language
ts: Ririmi Rin’wana

source: Other people validate those voice clips.
ts: \Vanhu van’wana va tiyisekisa swiphemu sweswo swa rito.

source: Other voice datasets…
ts: Tidatasete tin’wana ta rito...

source: Other Voice Datasets
ts: Tidatasete tin’wana ta Rito

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
ts: Mufambisi wa hina wa vaaki u ta fikelela eka wena ku ku nyika nseketelo lowu engetelekeke, ni ku ku tivisa ku ri loko se ku ri kona vaaki lava tirhaka eka ririmi ra wena.

source: Our governance is founded on the pillars of:
ts: Vulawuri bya hina byi sekeriwe eka tiphuphu ta:

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
ts: Tsalwa ra hina ra xihlovo ri vumbiwile hi minyikelo ya vahoxi va xandla vo sungula xikan’we na mbulavurisano ku suka eka switshuriwa swa tifilimi swa mani na mani swo fana na <italic>It's a Wonderful Life</italic>. U nga languta swivulwa swa hina swa xihlovo eka <githubLink>folda leyi ya GitHub</githubLink>.

source: Overall Accuracy
ts: Ku pakanisa hi ku angarhela

source: Overall Hr. Total
ts: Hi ku angarhela Hr. Hinkwaswo

source: Overall project status: see how far we’ve come!
ts: Xiyimo xa phurojeke hi ku angarhela: vona leswaku hi fike kwihi!

source: Papiamento (Aruba)
ts: Papiamento (Xihlala xa le Aruba)

source: Partners
ts: Vatirhisani

source: Partnerships and networks
ts: Ntirhisano na tinetiweki

source: Partner with local organizations or individuals
ts: Tirhisana na tinhlengeletano ta ndhawu kumbe vanhu

source: [Part of the text can’t be heard]
ts: [Xiphemu xa tsalwa a xi twiwi]

source: Pashto
ts: Xipashto

source: Past recordings download requests
ts: Swikombelo swo dawuniloda leswi rhekhodiweke leswi hundzeke

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
ts: <p>Common Voice i datasete ya marito leyi kumekaka eka un’wana na un’wana, leyi nyikiweke matimba hi marito vanyikeri vo tinyiketela emisaveni hinkwayo. Vanhu lava lavaka ku aka maendlelo ya marito va nga tirhisa datasete ku letela timodlele to dyondza hi michini.</p>. <p>Sweswi, tidathaseti to tala ta rito i ta tikhamphani, leswi sivelaka vutumbuluxi. Tidathaseti ta rito na tona a ti yimeli ngopfu: lava nga vulavuriki Xinghezi, vanhu vantima, lava lamaleke, vavasati na vanhu va LGBTQIA+. Leswi swi vula leswaku thekinoloji leyi tirhisaka rito a yi tirhi nikatsongo eka tindzimi to tala, naswona laha yi tirhaka kona, yi nga ha va yi nga tirhi kahle hi ku ringana eka un’wana ni un’wana. Hi lava ku cinca sweswo hi ku hlengeleta vanhu hinkwako ku avelana marito a vona.</p>

source: People come and contribute their voices.
ts: Vanhu va ta va ta hoxa xandla hi marito ya vona.

source: Persian
ts: Xiperesiya

source: Personal
ts: Ximunhu

source: Personal dashboards keep you up-to-date with individual and community progress.
ts: Tidashboard ta munhu hi xiyexe ti ku hlayisa u ri karhi u tiva nhluvuko wa munhu hi xiyexe na wa vaaki.

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
ts: <playbookLink>Kuma xiletelo lexi pfunaka</playbookLink> eka rendzo hinkwaro ra Common voice, ku suka eka ku endla nchumu wuva wa kwala ekaya ku ya eka matirhiselo ya datasete, xikan’we ni ndlela yo ku ti hlanganisa ni muganga wa hina.

source: <playIcon></playIcon>Last one!
ts: <playIcon></playIcon>Xo hetelela!

source: Play/Stop
ts: Tlanga/Yima

source: Please add a source.
ts: Hi kombela u engetela xihlovo.

source: Please add sentences.
ts: Hi kombela u engetela swivulwa.

source: Please check the <howToLink>guidelines</howToLink>.
ts: Hi kombela u languta <howToLink>swiletelo</howToLink>.

source: Please confirm that these sentences are public domain.
ts: Hi kombela u tiyisisa leswaku swivulwa leswi i swa mani na mani.

source: Please select a language.
ts: Hi kombela u hlawula ririmi.

source: Please select a language to review sentences.
ts: Hi kombela u hlawula ririmi leri u nga ta pfuxeta swivulwa.

source: Please try again.
ts: Hi kombela u ringeta nakambe.

source: Polish
ts: Xipolish

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
ts: <pontoonAccountLink>Endla akhawunti</pontoonAccountLink> loko u ri hava. Kutani, hlawula ririmi ra wena <strong>(‘Team’)</strong> ivi u hlawula phurojeke, <pontoonCvLink>Common Voice</pontoonCvLink>. Ku ta va na tifayela to hundzuluxela. Tsopeta eka yin’we, kutani yi kombisa marito ya Xinghezi na bokisi ro ma hundzuluxela.

source: Portuguese
ts: Xiputukezi

source: Press play, listen & tell us: did they accurately speak the sentence below?
ts: Cinekela eka tlanga, yingisela & hi byele: xana va vulavule kahle xivulwa lexi nga laha hansi?

source: Press { shortcut-play-toggle } to toggle play mode
ts: Cinekela { shortcut-play-toggle } ku cinca movha wo tlanga

source: Privacy
ts: Xihundla

source: Privacy Policy
ts: Pholisi ya Vuhlayiseki bya Swilo swa Xihundla

source: Privacy, security and transparency.
ts: Vuhlayiseki bya xihundla, vuhlayiseki na ku va erivaleni.

source: Profile
ts: Phurofayili

source: Profile information improves the audio data used in training speech recognition accuracy.
ts: Vuxokoxoko bya phurofayili byi antswisa datha ya mpfumawulo leyi tirhisiwaka eka ku letela ku pakanisa ka ku lemuka mbulavulo.

source: Profile: { $username }
ts: Profayile: { $username }

source: Progress
ts: Ndzima

source: Punctuation. Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
ts: Swihlawulekisi swa mapeletelo. Swikombiso swo hlawuleka ni swikombiso swa mapeletelo swi fanele swi katsiwa ntsena loko swi laveka hi ku helela. Xikombiso, apostrofi yi katsiwile eka marito ya Xinghezi yo fana na “don’t” na “we’re” naswona yi fanele ku katsiwa eka tsalwa ra xihlovo, kambe a swi tikombi leswaku u ta lava ku tirhisa xikombiso xo hlawuleka xo fana na “@” kumbe “#. ” .

source: Punjabi
ts: Xipunjabi

source: Quechua Chanka
ts: Xiquechua xa Chanka

source: [‘Raised’ in English is always pronounced as one syllable, not two]
ts: [‘Raised’ hi Xinghezi minkarhi hinkwayo yi vitaniwa tanihi xitwari xin’we, ku nga ri swimbirhi].

source: Reader Effects
ts: Vuyelo Bya Muhlayi

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
ts: Ku hlaya ku hlangana loku nga riki kona entiyisweni, ku fana na "We're" ematshan'wini ya "We are", kumbe vice versa.

source: Read More
ts: Hlaya Swin’wana

source: Read more on our About page
ts: Hlaya swo tala eka tluka ra hina ra Malunghana

source: Read our How-to if unsure how to attribute
ts: Hlaya Ndlela ya hina loko u nga tiyiseki leswaku u nga nghenisa vhoko njhani.

source: Read the sentence carefully - don’t miss, change or add words.
ts: Hlaya xivulwa hi vukheta - u nga hundziwi, u cinca kumbe ku engetela marito.

source: { $readyCount } sentences ready for submission!
ts: { $readyCount } swivulwa swi lunghekele ku rhumeriwa!

source: Ready to add your voice or lend your ear?
ts: Xana u lunghekele ku engetela rito ra wena kumbe ku lomba ndleve ya wena?

source: Ready to contribute?
ts: Xana u lunghekele ku hoxa xandla?

source: Ready to do { $count } more?
ts: U lunghekele ku endla { $count } swo tala?

source: Ready to donate your voice?
ts: Xana u lunghekele ku nyikela hi rito ra wena?

source: Ready to help validate sentences?
ts: Xana u lunghekele ku pfuneta ku tiyisisa swivulwa?

source: reCAPTCHA is required if you want to proceed
ts: reCAPTCHA ya laveka loko u lava ku ya emahlweni.

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
ts: Amukela ti-imeyili to fana na switsundzuxo swa ntlhontlho na pakani, ku pfuxetiwa ka nhluvuko, na swiphephana swa mahungu mayelana na Common Voice.

source: Recorded Clips
ts: Swiphemu leswi rhekhodiweke

source: Recorded Hours
ts: Tiawara Leti Rekhodiweke
